<template>
  <section>
    <van-nav-bar
      left-text="返回登录"
      @click-left="handleGoLogin"
    />
    <div class="policy-wrapper">
      <h1 v-if="type === 'privacy'" class="title">东坤 Digi Ads 隐私政策</h1>
      <h1 v-else-if="type === 'service'" class="title">东坤 Digi Ads 服务协议</h1>
      <h1 v-else-if="type === 'cookie'" class="title">Cookie 政策</h1>
      <template v-if="type === 'privacy'">
        <p>隐私政策更新（日期：2022-3-20）</p>
        <h2>产品介绍</h2>
        <p>
          广州市东坤信息科技有限公司是东坤DigiAds（以下简称【我们】）的运营者。本《隐私政策》（以下简称【本政策】）阐述了东坤DigiAds将如何收集和处理您的个人信息和隐私信息。东坤DigiAds将严格遵守法律法规，为您提供安全、可靠的服务。网站地址：www.superdigiads.com。
        </p>
        <h2>我们收集的信息</h2>
        <p>
          为了向您提供我们的服务，我们需要您提供使用该服务所必需的信息。我们只会收集为实现具体、特定、明确及合法的目的所必需的信息，并且不会对这些信息进行与上述目的不相符的进一步处理。您有权选择是否提供我们请求的信息，但多数情况下，如果您拒绝，我们可能无法向你提供相应的服务，也无法回应您遇到的问题。
        </p>
        <h2>您在使用我们服务时主动提供的信息</h2>
        <p>
          我们接收并存储您在东坤DigiAds上或以其他任何方式提供给我们的任何信息，包括邮箱、名字、电话号码、地址等。您可以选择不提供某些信息，但是这样可能使您无法使用我们提供的许多服务。
        </p>
        <h2>我们在您使用服务过程中收集的信息</h2>
        <p>在您使用我们提供的服务时，我们可能会收集以下信息：</p>
        <ul>
          <li>设备及应用信息。如设备型号、设备识别符、操作系统版本、信号强度、应用版本号、浏览器类型和设置等信息。</li>
          <li>
            移动网络信息。如公共陆地移动网络提供商 ID（PLMN）、地理位置（设备定位所在区域信号发射塔识别信息）、Internet
            协议（IP）地址。
          </li>
          <li>
            日志信息。当你使用我们的服务或者查看由我们提供的内容时，我们会自动收集某些信息并存储在日志中。如服务的访问时间、访问次数、访问
            IP、错误崩溃信息、网络请求信息等。
          </li>
          <li>
            位置信息。当您使用与位置有关的服务时，我们可能会采集您设备所在的位置信息，以便为您提供相关服务。在您使用服务时，我们可能会通过
            IP 地址、GPS、WLAN（如 Wi-Fi）或基站等途径获取您的地理位置信息。例如地区、经纬度信息、时区设置和语言设置
          </li>
          <li>索引词信息。当您使用我们提供的索引服务时，我们会收集您的索引词信息，以便提供高效的索引服务。</li>
          <li>为了帮助您更好地使用我们的产品或服务，我们会收集相关信息。</li>
        </ul>
        <h2>从第三方合作伙伴获取的信息</h2>
        <p>
          在法律允许的情况下，我们还会从公用和商用来源获取有关您的信息。例如，我们可能从第三方社交网络服务中获取某些信息，例如账户、昵称等。
        </p>
        <p>征得授权同意的例外</p>
        <p>您充分理解并同意，我们在以下情况下收集、使用您的个人信息无需您的授权同意：</p>
        <p>1、与国家安全、国防安全有关的；</p>
        <p>2、与公共安全、公共卫生、重大公共利益有关的；</p>
        <p>3、与犯罪侦查、起诉、审判和判决执行等司法或行政执法有关的；</p>
        <p>4、出于维护您或他人的生命财产安全但在特殊情况下无法获得您的及时授权；</p>
        <p>5、从其他合法公开的渠道中收集您的个人信息；</p>
        <p>6、法律法规规定的其他情形。</p>
        <h2>我们如何使用收集的信息</h2>
        <p>
          我们严格遵守法律法规的规定及与用户的约定，将收集的信息用于本政策所说明的用途。我们可能将您的个人信息用于以下用途：
        </p>
        <p>1、提供个性化用户服务和内容；</p>
        <p>2、向你发送营销资讯，包括我们的业务信息和我们认为您可能感兴趣的第三方业务；</p>
        <p>3、管理我们的业务；</p>
        <p>4、向第三方提供有关我们用户的统计信息；</p>
        <p>5、用于防止丢失和防止欺诈等目的的安全保障，协助识别用户、验证身份等；</p>
        <p>6、进行相关的推广活动</p>
        <p>7、进行数据分析、研究和开发与我们服务的使用相关的统计信息；</p>
        <p>8、储存并维护与您相关的信息，用于我们的业务运营或履行法律义务；</p>
        <p>9、提供基于位置的服务；</p>
        <p>10、发送通知；</p>
        <p>11、改善用户体验；</p>
        <p>12、其他征得您同意的目的；</p>
        <h2>我们如何使用 Cookie 和同类技术</h2>
        <h3>Cookie</h3>
        <p>
          Cookie 是一种网络服务器存储在计算机或移动设备上的纯文本文件。Cookie 的内容智能由创建它的服务器检索或读取。每个
          Cookie 对您的网络浏览器或移动应用程序都是唯一的。Cookie 通常包含标识符、站点名称等。
        </p>
        <p>
          我们有时会在在您的设备上存储 Cookie，我们启用 Cookie
          的目的在于改善用户体验，包括登录和验证、存储您的偏好和设置、统计分析、基于兴趣的广告等。您可根据自己的偏好管理、删除、禁用
          Cookie。但清除或禁用 Cookie 可能会影响您使用我们提供的服务的全部或部分功能。
        </p>
        <h3>网站信标/像素标签</h3>
        <p>
          除 Cookie
          外，我们还会在网站上使用网站信标或像素标签。网站信标通常是一种嵌入到网站或电子邮件中的电子图像，可用于在您查看网页或电子邮件时识别您设备上的
          Cookie。像素标签使我们可以以您可阅读的格式传送电子邮件，并使我们能够获知电子邮件是否被打开。我们将该类技术用于多种用途，包括分析服务使用情况（与
          Cookie 配合使用）以及提供更符合您需求的内容及广告。
        </p>
        <h2>我们如何共享、转让、公开披露您的个人信息</h2>
        <h3>共享</h3>
        <p>我们不会对外共享您的个人信息，但以下情况除外：</p>
        <p>1、在获得您的明确同意后，我们会向您指定的第三方共享您授权范围内的信息；</p>
        <p>2、我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息；</p>
        <p>
          3、您的信息可能会在我们的关联公司内共享。我们仅会出于特定、明确而合法的目的在我们的关联公司内共享您的信息，并且只会共享提供服务所必要的信息；
        </p>
        <p>
          4、您的信息可能会共享给我们的业务合作伙伴以保障为您提供的服务顺利完成。但我们仅出于合法、正当、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。
        </p>
        <h3>转让</h3>
        <p>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</p>
        <p>1、在获得您的明确同意后，我们会向其他方转让您的个人信息；</p>
        <p>
          2、在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本声明的约束，否则我们将要求该公司、组织重新向您征求授权同意。
        </p>
        <h3>公开披露</h3>
        <p>我们会在以下情况下，公开披露您的个人信息：</p>
        <p>1、获得您的明确同意后；</p>
        <p>
          2、基于法律或合理依据的公开披露：在法律、法律程序、诉讼或公共和政府主管部门有要求的情况下，我们可能会公开披露您的信息。
        </p>
        <h2>我们如何保存和保护您的个人信息</h2>
        <p>
          我们已经采取符合业界标准、合理可行的安全防护措施保护您的信息，防止个人信息遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非法律有强制的存留要求。
        </p>
        <p>
          互联网并非绝对安全的环境，使用我们提供的服务时，我们强烈建议您不要使用非我官方平台推荐的通信方式发送您的信息。
        </p>
        <p>
          请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息。请您更加谨慎地考虑，是否使用我们地服务时共享甚至公开分享相关信息。
        </p>
        <p>
          在不幸发生个人信息安全事件后，我们讲按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可以自主防范和降低风险的建议、对您的补救措施等。
        </p>
        <h2>您的权利</h2>
        <p>
          我们将尽一切可能采取适当的技术手段，保证收集的有关于您的个人信息的准确性，并保证及时进行更新。您也可以按照我们的相关政策及提示，对您的个人信息进行访问、更正及删除。
        </p>
        <h2>我们会如何处理未成年人的个人信息</h2>
        <p>
          我们的产品与服务主要面向成人，但对于使用我们产品与服务的未成年人，我们很清楚采取额外预防措施保护其隐私和安全的重要性。我们将不满
          18 周岁（或当地法律规定的年龄）的任何人均视为未成年人。我们不专门向 13 岁以下的儿童营销。
        </p>
        <p>
          对于经监护人同意而收集的未成年人个人信息，我们只会在法律允许、监护人明确同意或者保护未成年人所必要的情况下使用或披露。如果任何时候监护人需要访问、修改或删除与被监护人有关的个人信息，请按照本政策“联系我们”章节中介绍的方式与我们联系。
        </p>
        <p>
          如果我们发现自己在未事先获得可证实的监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关内容。
        </p>
        <h2>本隐私政策如何更新</h2>
        <p>我们保留不时更新或修改本声明的权利。</p>
        <p>
          如果该等变更会导致您在本政策项下权利的实质减损，我们将在变更生效前，通过在页面显著位置提示等方式通知您。对于重大变更，我们还会提供更为显著的通知。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的政策约束。本政策所指的重大变更包括但不限于：
        </p>
        <p>1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</p>
        <p>2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</p>
        <p>3、个人信息共享、转让或公开披露的主要对象发生变化；</p>
        <p>4、您参与个人信息处理方面的权利及其行使方式发生重大变化；</p>
        <p>5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</p>
        <p>6、个人信息安全影响评估报告表明存在高风险时。</p>
        <h2>联系我们</h2>
        <p>如果您对本隐私政策有任何疑问，可以使用以下信息与我们联系。</p>
        <p>邮箱：service@superdigiads.com</p>
        <p>客服微信：Dbgj-Adseasy</p>
        <p>地址：RM22 2/F FU TAO BUILDING，NO.98 ARGYLE，STREET KOWLOON HONG KONG</p>
      </template>
      <template v-else-if="type === 'service'">
        <h2>定义和说明</h2>
        <p>
          《东坤 Digi Ads 服务协议》（以下简称“本协议”）是用户（以下简称“用户”或您）与东坤 Digi Ads 之间的协议，东坤
          Digi Ads
          将按照本协议约定之内容为您提供服务。请您务必审慎阅读、充分理解各条款内容，若您不同意本协议中所述任何条款或其后对协议条款的修改，请您不要使用东坤
          Digi Ads
          及相关服务。您的使用行为将视作对本协议全部条款的完全接受。如果您是未成年人，请在法定监护人的陪同下阅读和判断是否同意本协议，特别注意未成年人使用条款。未成年人行使和履行本协议项下的权利和义务视为已获得监护人的认可。
        </p>
        <p>东坤 Digi Ads 向您提供包括但不限于如下服务：</p>
        <ul>
          <li>东坤 Digi Ads 平台：东坤 Digi Ads 网站 www.superdigiads.com 及客户端；</li>
          <li>东坤 Digi Ads 直接拥有或运营的服务器、网络存储空间；</li>
          <li>东坤 Digi Ads 提供给您的各类增值服务；</li>
          <li>东坤 Digi Ads 提供给您的其他技术和/或服务。</li>
        </ul>
        <h2>账户的注册、使用及注销</h2>
        <h3>注册</h3>
        <p>
          1. 东坤 Digi Ads 及相关服务为您提供了注册通道，您有权选择合法的字
          符组合作为自己的账号，并自行设置符合安全要求的密码。用户设置的账号、密码是用户用以登录并使用东坤 Digi Ads
          及相关服务的凭证。若您为未成年人，东坤 Digi Ads 将依法根据国家相关法律法规及监管要求限制您的使用行为。
        </p>
        <p>
          2. 您理解并承诺，您所设置的账号不得违反国家法律及东坤 Digi Ads 的
          相关规则，不得实施任何侵害国家利益、损害其他公民合法权益，有害社
          会道德风尚的行为，您的账号名称、头像和简介等注册信息及其他个人信
          息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不
          限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设 账号，不得恶意注册东坤 Digi Ads
          账号（包括但不限于频繁注册、批量 注册账号等行为）。东坤 Digi Ads 有权对您提交的信息进行审核。您在账
          户注册使用过程中需遵守法律法规、社会主义制度、国家利益、公民合法
          权益、社会公共秩序、道德风尚及信息真实性等“七条底线”要求。
        </p>
        <p>
          3. 在注册、使用和管理帐号时，您应保证注册帐号时填写的身份信息的
          真实性，请您在注册、管理帐号时使用真实、准确、合法、有效的相关身
          份证明材料及必要信息（包括您的姓名及电子邮件地址、联系电话、联系
          地址等），若国家法律法规有特殊规定，您需要填写真实的身份信息，请
          您按照相关法律规定完成实名认证，以便我们在必要时与您联系或为您提
          供更好的服务，并注意及时更新上述相关信息。若您提交的材料或提供的
          信息不准确、不真实、不合法或者我们有理由怀疑为错误、不实或不合法 的资料，则您可能无法使用东坤 Digi Ads
          或服务，或在使用过程中部分 功能受到限制。
        </p>
        <h3>使用</h3>
        <p>
          1. 您的账号仅限于您本人使用，未经东坤 Digi Ads 书面同意，禁止以任
          何形式赠与、借用、出租、转让、售卖或以其他方式许可他人使用该账号。 如果东坤 Digi Ads
          发现或者有合理理由认为使用者并非账号初始注册人， 为保障账号安全，东坤 Digi Ads
          有权立即暂停或终止向该注册账号提供 服务，或注销该账号。
        </p>
        <p>
          2. 您有责任维护个人账号、密码的安全性与保密性，并对您以注册账号
          名义所从事的活动承担全部法律责任，包括但不限于您在东坤 Digi Ads
          及相关服务上进行的任何数据修改、言论发表、款项支付等操作行为可能
          引起的一切法律责任。您应高度重视对账号与密码的保密，在任何情况下
          不向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他 任何安全漏洞问题时，您应当立即通知东坤 Digi
          Ads。
        </p>
        <p>
          3. 在丢失账号或遗忘密码时，您可遵照东坤 Digi Ads 的申诉途径及时申 诉请求找回账号或密码。您理解并认可，东坤
          Digi Ads 的密码找回机制 仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申
          诉人是否系真正账号有权使用者。东坤 Digi Ads 特别提醒您应妥善保管
          您的账号和密码。当您使用完毕后，应安全退出。如因您保管不当等自身
          原因或其他不可抗因素导致遭受盗号或密码丢失，您将自行承担相应责任。
        </p>
        <p>
          4. 因其他人恶意攻击或您自身原因或其他不可抗因素而导致帐号被盗、 丢失，均由您本人承担责任，东坤 Digi Ads
          不承担任何责任。
        </p>
        <p>
          5. 东坤 Digi Ads 依照本协议、相关规则限制您使用帐号全部或部分功能
          的，可能会给您造成一定的损失，您理解该损失由您自行承担，东坤 Digi Ads 不承担责任。
        </p>
        <p>
          6. 除自行注册东坤 Digi Ads 账号外，您也可授权使用您合法拥有的包括 但不限于东坤 Digi Ads
          和/或其关联公司其他软件用户账号，以及实名注 册的第三方软件用户账号登录使用东坤 Digi Ads 及相关服务，但第三方
          软件或平台对此有限制或禁止的除外。当您以前述已有账号登录使用的，
          应保证相应账号已进行实名注册登记，并同样适用本协议中的相关条款。
        </p>
        <p>
          7. 您理解并同意，除您登录、使用东坤 Digi Ads 及相关服务外，您还可 以用东坤 Digi Ads 账号登录使用东坤 Digi Ads
          及其关联公司或合作的 第三方提供的其他软件、服务。您以东坤 Digi Ads 账号登录并使用前述
          服务时，将受到前述服务的实际提供方的《用户协议》及其他协议条款约 束。
        </p>
        <p>
          8. 身份要素是我们识别您身份的依据，请您务必妥善保管。使用身份要
          素进行的操作、发出的指令视为您本人做出。因您的原因造成的账户、密
          码等信息被冒用、盗用或非法使用，由此引起的风险和损失需要由您自行 承担。
          您同意，基于不同的终端以及您的使用习惯，我们可能采取不同 的验证措施识别您的身份。
        </p>
        <p>
          9. 您理解并同意，为了充分使用账号资源，如您在注册后未及时进行初
          次登录使用或连续超过一年未登录账号使用等情形，东坤 Digi Ads 有权 收回您的账号昵称。
        </p>
        <h3>注销</h3>
        <p>
          1. 您有权向东坤 Digi Ads 提出账号注销申请。注销东坤 Digi Ads 账号 后，您将无法再以此账号登录和使用东坤 Digi
          Ads 及相关服务，东坤 Digi Ads 也将同时终止在该账号下为您提供我们各项产品与服务。且东坤 Digi Ads
          账号一旦注销完成，将无法恢复。请您在注销前慎重考虑。
        </p>
        <p>
          2. 如您确定需要注销东坤 Digi Ads 账号，您已充分知晓并确认，账号注
          销后您将不再拥有该账号相关的权益，包括但不限于：
        </p>
        <ul>
          <li>账号注销后，您将无法再以该账号登录、使用东坤 Digi Ads 及相关服 务；</li>
          <li>
            账号注销后，您曾通过该账号登录、使用东坤 Digi Ads 及相关服务的
            所有内容、信息、数据、记录将会被删除或匿名化处理，您也无法再
            搜索、访问、获取、使用和找回，包括但不限于：账号信息（头像、 昵称、签名等）、绑定信息；
          </li>
          <li>账号注销后，该账号的交易记录将被清空且无法恢复；</li>
          <li>
            您同意通过账号注销的方式放弃该账户在东坤 Digi Ads 及相关服务 中已产生但未消耗完毕的权益及未来的预期权益；
          </li>
          <li>账号注销后，东坤 Digi Ads 有权不再向用户提供任何与账号有关的服 务。</li>
        </ul>
        <p>
          3. 在您向我们申请注销东坤 Digi Ads 账号之前，为了保护您的账号安全
          和财产权益，您需先行检查与确保您申请注销的账号已经同时满足以下条 件，包括但不限于：
        </p>
        <ul>
          <li>账号系用户通过官方渠道注册，符合本协议及相关规定的账号；且为 您本人的账号；</li>
          <li>按照规定的注销流程进行注销操作；</li>
          <li>
            账号处于安全状态，包括：未处于申请找回密码、修改手机号的状态
            中；无未处理完毕的投诉、举报；其他不安全/异常状态；
          </li>
          <li>账号内无未处理完毕的交易；</li>
          <li>其他应满足的条件。</li>
        </ul>
        <p>
          4. 东坤 Digi Ads 账号一旦注销，您与我们曾签属过的相关用户协议、其
          他权利义务性文件等相应终止（但已约定继续生效的或法律另有规定的除
          外）。同时，您悉知并同意：即使您的账号被注销了，也并不能减轻或免
          除您在协议期间内应根据相关法律法规、相关协议、规则等（可能）需要 承担的相关责任。
        </p>
        <h2>知识产权</h2>
        <p>
          1. 东坤 Digi Ads 及相关服务上的内容，包括但不限于著作、图片、档案、
          资讯、资料、网站架构、网站画面的安排、网页设计，均由东坤 Digi Ads
          或关联公司依法拥有知识产权，包括但不限于商标权，专利权、著作权、 商业秘密等。
        </p>
        <p>
          2. 非经东坤 Digi Ads 或关联公司书面同意，请勿擅自适用、修改、反向
          编译、复制、公开传播、改变、散布、发行或公开发表东坤 Digi Ads 及 服务中的相关内容。
        </p>
        <p>
          3. 除非您与东坤 Digi Ads 另有书面协议，否则，本服务条款中的任何规 定均未授予您使用东坤 Digi Ads
          的任何商品名、商标、服务标记、徽标、 域名及其他显著品牌特征的权利。
        </p>
        <p>4. 尊重知识产权是您应尽的义务，如有违反，您需要承担损害赔偿责任。</p>
        <h2>隐私保护</h2>
        <p>
          东坤 Digi Ads 充分尊重用户个人信息的保护，东坤 Digi Ads 的隐私政 策介绍了您在使用东坤 Digi Ads
          及相关服务时，东坤 Digi Ads 如何处 理您的个人信息。您使用东坤 Digi Ads 及相关服务，即表示您同意东坤 Digi Ads
          可以按照隐私政策进行处理相应信息。
        </p>
        <h2>用户行为规范</h2>
        <p>1. 在使用东坤 Digi Ads 及相关服务过程中，应遵守以下法律法规：</p>
        <ul>
          <li>《中华人民共和国保守国家秘密法》</li>
          <li>《中华人民共和国著作权法》</li>
          <li>《中华人民共和国计算机信息系统安全保护条例》</li>
          <li>《计算机软件保护条例》</li>
          <li>《互联网电子公告服务管理规定》</li>
          <li>《信息网络传播权保护条例》</li>
          <li>《中华人民共和国网络安全法》</li>
          <li>其他有关计算机及互联网规定的法律、法规。</li>
        </ul>
        <p>
          2. 在任何情况下，东坤 Digi Ads 一旦合理地认为用户地行为可能违反上
          述法律、法规，可以在任何时候，不经事先通知终止向该用户提供服务。
        </p>
        <p>3. 禁止用户从事以下行为：</p>
        <ul>
          <li>以任何方式危害未成年人；</li>
          <li>冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人 或任何机构有关；</li>
          <li>干扰或破坏东坤 Digi Ads 及相关服务或与东坤 Digi Ads 及服务相连 的服务器和网络，或不遵守本协议之规定；</li>
          <li>故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具 有法律效力的规范；</li>
          <li>
            未经东坤 Digi Ads 事先明确书面许可，以任何方式（包括但不限于机
            器人软件、蜘蛛软件、爬虫软件等任何自动程序、脚本、软件）和任
            何理由自行或委托他人、协助他人获取平台的服务、内容、数据；
          </li>
        </ul>
        <h2>免责声明</h2>
        <p>1. 因下列原因导致我们无法正常提供服务，我们免于承担责任：</p>
        <ul>
          <li>我们的系统停机维护或升级；</li>
          <li>因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；</li>
          <li>您的设备软硬件和通信线路、供电线路出现故障的；</li>
          <li>因您操作不当或通过非经我们授权或认可的方式使用我们服务的；</li>
          <li>
            因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备
            故障、通讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为 等原因。
          </li>
        </ul>
        <p>尽管有前款约定，我们将采取合理行动积极促使服务恢复正常。</p>
        <p>
          2. 在任何情况下，东坤 Digi Ads 均不对任何间接性、后果性、惩罚性、
          偶然性、特殊性或刑罚性的损害，包括因您使用东坤 Digi Ads 及相关服 务而遭受的利润损失，承担责任。东坤 Digi Ads
          对您承担的全部责任， 无论因何原因或何种行为方式，始终不超过您在因使用东坤 Digi Ads 软 件及相关服务而支付给东坤
          Digi Ads 的费用(如有)。
        </p>
        <h2>法律的适用和管辖</h2>
        <p>
          本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。
          您因使用我方服务所产生及与我方平台服务有关的争议，由我方与您协商
          解决。如经协商不能得到解决时，应提交【广州仲裁委员会】，根据提交
          仲裁时广州仲裁委员的仲裁规则进行仲裁，仲裁地点在【广州】，仲裁语
          言为中文。仲裁裁决是终局性的，对各方均有约束力。
        </p>
        <h2>服务的变更、中断和终止</h2>
        <p>
          1. 您理解并同意，东坤 Digi Ads 基于经营策略的调整，可能会对服务内 容进行变更，也可能会中断、中止或终止服务。
        </p>
        <p>
          2. 您理解并同意，如东坤 Digi Ads 发生合并、分立、收购、资产转让时， 东坤 Digi Ads
          可向第三方转让本服务下相关资产；东坤 Digi Ads 亦可
          在单方通知您后，将本协议下部分或全部服务及相应的权利义务转交由第 三方运营或履行。
        </p>
        <p>
          3. 您理解并同意，如您违反相关法律法规的规定、违反本协议及其他东 坤 Digi Ads 相关约定，东坤 Digi Ads
          有权不经通知而单方中断或终止 向您提供服务。
        </p>
        <p>
          4. 东坤 Digi Ads 终止向您提供服务后，有权根据适用法律的要求删除您
          的个人信息，或使其匿名化处理，亦有权依照法律法规的期限和方式继续 保存您留存于我方平台的其他内容和信息。
        </p>
        <p>
          5. 您理解并同意，东坤 Digi Ads 运营方需要定期或不定期地对提供的服
          务或相关的设备进行维护或检修，如因此类情况而造成服务在合理时间内 的中断，东坤 Digi Ads
          运营方无需为此承担任何责任，但东坤 Digi Ads 运营方应尽可能事先进行通告。
        </p>
        <h2>费用条款</h2>
        <p>1. 当您在东坤 Digi Ads 内购置服务时，请您务必仔细确认所购服务的时 间、内容、限制性要求等重要事项。</p>
        <p>
          2. 东坤 Digi Ads 有权决定内置服务的收费方式和资费标准，且东坤 Digi Ads
          有权根据需要对资费政策随时进行调整。如某服务有可能出现降价或 促销的情况，东坤 Digi Ads 不提供价格保护或退款。
        </p>
        <p>
          3. 用户购买东坤 Digi Ads 内置服务时使用的支付方式由第三方提供，东 坤 Digi Ads
          对支付过程中可能存在的延迟、错误等问题不承担责任。
        </p>
        <h2>未成年人使用条款</h2>
        <p>
          1. 东坤 Digi Ads 非常注重未成年人的保护。若您是未成年人，应在监护
          人监护、指导下阅读本协议，并在取得监护人的同意后使用东坤 Digi Ads 及相关服务。
        </p>
        <p>
          2. 未成年用户理解如因你违反法律法规、本协议内容，则您及您的监护
          人应依照法律法规承担因此而可能引起的全部法律责任。
        </p>
        <h2>条款变更与通知</h2>
        <p>
          东坤 Digi Ads 有权在必要的时候修改本协议条款，请您定期查询有关内
          容。用户如继续使用本协议涉及的服务，则视为对修改内容的同意；用户
          在不同意修改内容的情况下，应当终止本协议并停止使用相关服务。
        </p>
        <h2>联系我们</h2>
        <p>如果您对本服务协议有任何疑问，可以通过以下方式与我们联系。</p>
        <p>邮箱：service@superdigiads.com</p>
        <p>客服微信：Dbgj-Adseasy</p>
        <p>地址：RM22 2/F FU TAO BUILDING ，NO.98 ARGYLE，STREET KOWLOON HONG KONG</p>
      </template>
    </div>
  </section>
</template>
<script>
import { NavBar } from 'vant'
export default {
  name: 'Policy',
  mixins: [],
  components: {
    VanNavBar: NavBar
  },
  filters: {},
  props: {},
  data () {
    return {
      type: null
    }
  },
  computed: {},
  watch: {},
  created () {
    this.type = this.$route.query?.type
  },
  mounted () {},
  methods: {
    initial () {},
    handleGoLogin () {
      this.$router.back()
    }
  }
}
</script>
<style lang="less" scoped>
.policy {
  &-wrapper {
    padding: 10px;
    & > p {
      font-size: 14px;
      line-height: 28px;
    }
  }
}
</style>
